ITHACA-FV/tutorials/CFD/17YJunction/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "5";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0.558023 0.224085 0)
(0.622494 -0.133179 5.80214e-21)
(0.230672 -0.0711897 1.28478e-20)
(0.535148 0.133621 0)
(0.236431 0.00581425 1.17087e-20)
(0.52605 -0.143712 0)
(0.583907 0.157724 -1.72754e-21)
(0.570772 -0.181858 -2.95766e-21)
...
)
;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            fixedValue;
        value           uniform (0.5 -0.866025 0);
    }
    inlet2
    {
        type            fixedValue;
        value           uniform (0.5 0.866025 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
