ITHACA-FV/tutorials/CFD/17YJunction/0/Ulift1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0.502567759948 0.331810035612 0)
(0.4820435389 0.195084091699 -5.2507133229e-21)
(0.370306800191 0.276895394245 2.84638818999e-21)
(0.504846812267 0.281189577985 0)
(0.391144296127 0.290271414137 4.92487123834e-21)
(0.441815947255 0.190351955974 0)
(0.523943851642 0.298466725944 -1.70477999486e-21)
(0.445359017245 0.189210401055 -3.17738697727e-21)
...
)
;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet2
    {
        type            fixedValue;
        value           uniform (1 1 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
