ITHACA-FV/tutorials/CFD/17YJunction/0/Uliftx0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Uliftx0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0.416974132882 0 0)
(0.534498918484 0 0)
(0.410603461669 0 0)
(0.439099227472 0 0)
(0.382323535349 0 0)
(0.496798223448 0 0)
(0.453314550919 0 0)
(0.52358192585 0 0)
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            calculated;
        value           uniform (1 0 0);
    }
    inlet2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(0.55556880306 0 0)
(0.612370614734 0 0)
(0.645219693557 0 0)
(0.666486249577 0 0)
(0.681164954076 0 0)
(0.691597217592 0 0)
(0.699059563903 0 0)
(0.704362556568 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
