ITHACA-FV/tutorials/CFD/17YJunction/0/Uliftx1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Uliftx1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0.502567759948 0 0)
(0.4820435389 0 0)
(0.370306800191 0 0)
(0.504846812267 0 0)
(0.391144296127 0 0)
(0.441815947255 0 0)
(0.523943851642 0 0)
(0.445359017245 0 0)
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet2
    {
        type            calculated;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(0.554168050874 0 0)
(0.610985207084 0 0)
(0.643864807217 0 0)
(0.665176725709 0 0)
(0.679915138226 0 0)
(0.690420800791 0 0)
(0.697969431335 0 0)
(0.703370650568 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
