ITHACA-FV/tutorials/CFD/17YJunction/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss linear;
    //div(phi,U)      Gauss limitedLinearV 1;

    //div(L_U_SUPmodes) Gauss limitedLinearV 1;
    //div(phi,U)      Gauss limitedLinearV 1;
    //div(phi,k)      Gauss limitedLinear 1;
    //div(phi,epsilon) Gauss limitedLinear 1;
    //div(phi,R)      Gauss limitedLinear 1;
    //div(R)          Gauss linear;
    //div(phi,nuTilda) Gauss limitedLinear 1;
    //div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
    Phi;
}


// ************************************************************************* //
